INVALID_NUM = 'Пожалуйста, введите число.'

HELLO = (
    'Привет {name}, я GrowBot!\n'
    'Я могу помочь тебе почитать необходимое количество LED-освещения '
    'в помещении для выращивания.\n'
    'Чтобы приступить к рассчётам нажми на кнопку "/calculate_light".'
)

ENTRY_BOX_WIDTH = 'Введите ширину бокса в сантиметрах.'
ENTRY_BOX_DEPTH = 'Введите глубину бокса в сантиметрах.'
ENTRY_BOX_HEIGHT = 'Введите высоту бокса в сантиметрах.'

CALC_LIGHT_RESULT = (
    "Площадь твоего бокса {square} квадратных метров.\n"
    "На такую площадь в среднем требуется от {LED_min} до {LED_max} ватт.\n"
    "LET's GROW ^_^"
)
